nxp-appcodehub/dm-mcxc242-pn7160-plug-and-play-nfc-controller/drivers/common/fsl_common_arm.h
    return true;
    
}

static inline bool _SDK_AtomicLocalCompareAndSet2Byte(volatile uint16_t *addr, uint16_t expected, uint16_t newValue)
{
    uint16_t s_actual;

    do
    {
        s_actual = __LDREXH(addr);
        if (s_actual != expected)
        {
            /* Workaround for CMSIS 6.1 Issue #264(https://github.com/ARM-software/CMSIS_6/issues/264). */
#if (defined(__ICCARM__) && (__CM_CMSIS_VERSION  == 0x60001UL))
          {
            __ASM volatile("CLREX" ::: "memory");
          }
#else
            __CLREX();
#endif
            return false;
        }
    } while (0U != (__STREXH((newValue), (addr))));

    return true;
}

static inline bool _SDK_AtomicLocalCompareAndSet4Byte(volatile uint32_t *addr, uint32_t expected, uint32_t newValue)
{
    uint32_t s_actual;

    do
    {
        s_actual = __LDREXW(addr);
        if (s_actual != expected)
        {
            /* Workaround for CMSIS 6.1 Issue #264(https://github.com/ARM-software/CMSIS_6/issues/264). */
#if (defined(__ICCARM__) && (__CM_CMSIS_VERSION  == 0x60001UL))
          {
            __ASM volatile("CLREX" ::: "memory");
          }
#else
            __CLREX();
#endif
            return false;
        }
    } while (0U != (__STREXW((newValue), (addr))));

    return true;
}

static inline uint8_t _SDK_AtomicLocalTestAndSet1Byte(volatile uint8_t *addr, uint8_t newValue)
{
    uint8_t s_old;

    do
    {
        s_old = __LDREXB(addr);
    } while (0U != (__STREXB((newValue), (addr))));

    return s_old;
}

static inline uint16_t _SDK_AtomicLocalTestAndSet2Byte(volatile uint16_t *addr, uint16_t newValue)
{
    uint16_t s_old;

    do
    {
        s_old = __LDREXH(addr);
    } while (0U != (__STREXH((newValue), (addr))));

    return s_old;
}

static inline uint32_t _SDK_AtomicLocalTestAndSet4Byte(volatile uint32_t *addr, uint32_t newValue)
{
    uint32_t s_old;

    do
    {
        s_old = __LDREXW(addr);
    } while (0U != (__STREXW((newValue), (addr))));

    return s_old;
}

#else
static inline bool _SDK_AtomicLocalCompareAndSet(uint32_t *addr, uint32_t expected, uint32_t newValue)
{
    uint32_t s_atomicOldInt;
    uint32_t s_actual;

    s_atomicOldInt = DisableGlobalIRQ();
    
    s_actual = *addr;
    if (s_actual == expected)
    {
        *addr = newValue;
        EnableGlobalIRQ(s_atomicOldInt);
        return true;
    }
    else
    {
        EnableGlobalIRQ(s_atomicOldInt);
        return false;
    }
}

static inline uint32_t _SDK_AtomicTestAndSet(uint32_t *addr, uint32_t newValue)
{
    uint32_t s_atomicOldInt = DisableGlobalIRQ();

    uint32_t oldValue = (uint32_t)(*addr);
    *addr = newValue;

    EnableGlobalIRQ(s_atomicOldInt);
    return oldValue;
}

#endif

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @} */

#endif /* FSL_COMMON_ARM_H_ */
